jeffskinnerbox/esp32-walkie-talkie/test/hello-world-6/DeBug.cpp

/* -----------------------------------------------------------------------------
Maintainer:   jeffskinnerbox@yahoo.com / www.jeffskinnerbox.me
Version:      0.9.6

DESCRIPTION:

PHYSICAL DESIGN:
    Just ESP8266 or ESP32 board, nothing else required

MONITOR:
    For full monitoring, make sure serial = true and telnet = true when you
    create the DeBug object (as done at the end of this file).

    sudo arp-scan 192.168.1.0/24 | grep Espressif
    sudo netdiscover -c 3 -s 10 -L -N -r 192.168.1.0/24 | grep Espressif

    screen /dev/ttyUSB0 9600,cs8cls

    to terminate `Ctrl-a :quit`

    telnet ntp-clock.local
    telnet 192.168.1.44
    telnet ESP_24F9FD.fios-router.home.
    telnet ESP_24F9FD

    to terminate `Ctrl-] quit`

REFERENCE MATERIALS:

SOURCES:

CREATED BY:
    jeffskinnerbox@yahoo.com

----------------------------------------------------------------------------- */

#define TDEBUG  false         // should we activate trace message printing for debugging

#define BUFFER1 25            // array size for small buffer
#define BUFFER2 50            // array size for medium buffer
#define BUFFER3 100           // array size for large buffer

#ifdef ESP32                  // found in ESP32 libraries (~/.arduino15/packages/esp32/)
#include <WiFi.h>
#include <driver/i2s.h>       // i2s driver
#else                         // found in ESP8266 libraries (~/.arduino15/packages/esp8266)
#include <ESP8266WiFi.h>
#endif


// found in Arduino libraries (~/Arduino/libraries)
#include <TelnetStream.h>

// found in Arduino libraries (~/src/arduino/libraries)

// found in Arduino Sketchbooks libraries (~/src/arduino/sketchbooks/libraries)

// for trace messages/debugging, found in this directory
#include "DeBug.h"


// ------------------------ Constructors & Destructors -------------------------

// default constructors for the class
DeBug::DeBug(void) {

    serial = true;      // flag to turn on/off serial trace messages
    telnet = false;     // flag to turn on/off telnet trace messages
    prefix = false;     // flag to turn on/off prefix for trace messages

    cols = LABEL_COLS;  // max characters in labels
    rows = LABEL_ROWS;  // number of labels

    // create matrix used to store trace message labels
    label = new char*[rows];
    if (rows) {
        label[0] = new char[rows * cols];
        for (int i = 1; i < rows; ++i)
            label[i] = label[0] + i * cols;
    }

    // initialize trace message labels
    setLables();

}


// constructors for the class
DeBug::DeBug(bool s, bool t, bool p) {

    serial = s;         // flag to turn on/off serial trace messages
    telnet = t;         // flag to turn on/off telnet trace messages
    prefix = p;         // flag to turn on/off prefix for trace messages

    cols = LABEL_COLS;  // max characters in labels
    rows = LABEL_ROWS;  // number of labels

    // create matrix used to store trace message labels
    label = new char*[rows];
    if (rows) {
        label[0] = new char[rows * cols];
        for (int i = 1; i < rows; ++i)
            label[i] = label[0] + i * cols;
    }

    // initialize trace message labels
    setLables();

}


// destructors for the class
DeBug::~DeBug(void) {
    // delete array used to store trace message labels
    if (rows) delete [] label[0];
    delete [] label;
};



// ------------------------------ Private Methods ------------------------------

// setup lables
void DeBug::setLables(void) {

    // initialize trace message labels
    label[INFO] =       "\e[1;32mINFO:    \e[m";           // bold green font
    label[STAT] =       "\e[1;34mSTATUS:  \e[m";           // bold blue font
    label[WARN] =       "\e[1;33mWARNING: \e[m";           // bold yellow font
    label[ERROR] =      "\e[1;31mERROR:   \e[m";           // bold red font
    label[FATAL] =      "\e[1;37m\e[41mFATAL:\e[m   ";     // bold White font on red background
    label[NOOP] =       "\e[1;35mNO-OP:   \e[m";           // bold purple font
    label[HEADING] =    "\e[1;37m\e[40m\n\rHEADING:\e[m";  // bold white font on black background
    label[UNLABELED] =  "";                                // no labels

}


// check the status of wifi, is it on or off
bool DeBug::checkWiFi(void) {

    if (WiFi.status() != WL_CONNECTED)
        return false;
    else
        return true;

}


// parser the characters entered via serial or telnet and execute proper action
void DeBug::commandParser(char c) {

    switch (c) {
        case 'R':   // reboot the esp8266 / esp32
            traceMsg(INFO, "Rebooting ...");
            if (serial) Serial.flush();
            if (serial) Serial.end();
            if (telnet) TelnetStream.flush();
            if (telnet) TelnetStream.stop();
            delay(100);
            ESP.restart();
            break;
        case 'C':   // drop telnet connection to esp8266 / esp32
            traceMsg(INFO, "Dropping telnet connection ... bye bye");
            Serial.flush();
            TelnetStream.flush();
            TelnetStream.stop();
            break;
        case 's':   // toggle on/off serial trace messages
            traceMsg(INFO, "Toggle on/off serial trace messages");
            serialOnOff(!serial);
            break;
        case 't':   // toggle on/off telnet trace messages
            traceMsg(INFO, "Toggle on/off telnet trace messages");
            telnetOnOff(!telnet);
            break;
        case 'p':   // toggle on/off prefix for trace messages
            traceMsg(INFO, "Toggle on/off prefix for trace messages");
            prefixOnOff(!prefix);
            break;
        case 0xFF:
            break;
        default:
            //traceMsg(WARN, "Unknown character in commandParser() = ", c);
            break;
    }

}



// ------------------------------- Public Methods ------------------------------

// print status of Debug object
void DeBug::printStatus(void) {

    traceMsg(STAT, "Current state of DeBug object:");

    traceMsg(STAT, "\tSerial trace message print = %s", serial ? "true" : "false");
    traceMsg(STAT, "\tTelnet trace message print = %s", telnet ? "true" : "false");
    traceMsg(STAT, "\tPrefix on trace message = %s", prefix ? "true" : "false");

