jeffskinnerbox/esp32-walkie-talkie/test/hello-world-6/DeBug.cpp
}


// print file name, function name, and line number
void DeBug::location(void) {
    traceMsg(NOOP, "NOT IMPLEMENTED YET: Plan to provide file name + function name + line number as a prefix to trace message");
    Serial.printf("%s, %s, %d: \t\n\r", __FILE__, __FUNCTION__, __LINE__);
}


void DeBug::SetupHandler(void) {

    printMsg("\n\n\r");   // make sure you have a clean line after reboot

    //serialOnOff(true);
    //telnetOnOff(true);
    //prefixOnOff(false);
    OnOff(true, true, false);

}


void DeBug::SetupHandler(bool ser, bool tel, bool pre) {

    printMsg("\n\n\r");   // make sure you have a clean line after reboot

    //serialOnOff(ser);
    //telnetOnOff(tel);
    //prefixOnOff(pre);
    OnOff(ser, tel, pre);

}


void DeBug::serialOnOff(bool flag) {

    if (flag) {
        traceMsg(STAT, "Serial DeBug printing is enabled");
    } else {
        traceMsg(STAT, "Serial DeBug printing is disabled");
        Serial.flush();
    }

    serial = flag;                // update DeBug object's flag

}


void DeBug::telnetOnOff(bool flag) {

    if (flag)
        if (!checkWiFi()) {
            traceMsg(WARN, "WiFi isn't connected, therefore, use of telnet (TelnetStream) could cause crash");
            traceMsg(STAT, "Telnet DeBug printing is disabled");
            telnet = false;       // update DeBug object's flag
            return;
    }

    if (flag) {
        TelnetStream.begin();
        traceMsg(STAT, "Telnet DeBug printing is enabled");
    } else {
        TelnetStream.flush();
        traceMsg(STAT, "Telnet DeBug printing is disabled");
    }

    telnet = flag;                // update DeBug object's flag

}


void DeBug::prefixOnOff(bool flag) {

    if (flag)
        traceMsg(STAT, "Prefix DeBug printing is enabled");
    else
        traceMsg(STAT, "Prefix DeBug printing is disabled");

    prefix = flag;                // update DeBug object's flag

}


void DeBug::OnOff(bool flag1, bool flag2, bool flag3) {

    serialOnOff(flag1);
    telnetOnOff(flag2);
    prefixOnOff(flag3);

}


void DeBug::printInfo(void) {

    uint32_t chipid = 0;
    char buf[BUFFER1];
    int rtn;

    rtn = snprintf(buf, BUFFER1, "%02X:%02X:%02X:%02X:%02X:%02X",
        WiFi.macAddress()[0], WiFi.macAddress()[1], WiFi.macAddress()[2],
        WiFi.macAddress()[3], WiFi.macAddress()[4], WiFi.macAddress()[5]);
    if (rtn <= 0 && rtn >= BUFFER1) {
        traceMsg(ERROR, "Buffer overflow condition in DeBug::traceMsg() - #5");
    }

#ifdef ESP32
	for (int i = 0; i < 17; i = i + 8) {
	  chipid |= ((ESP.getEfuseMac() >> (40 - i)) & 0xff) << i;
	}

    traceMsg(INFO, "Information concerning ESP & flash memory chips:");
    traceMsg(INFO, "\tESP32 IP Address = %s",  WiFi.localIP());
    traceMsg(INFO, "\tESP32 MAC Address = %s", buf);
    traceMsg(INFO, "\tESP32 DHCP Hostname = %s", WiFi.getHostname());
    traceMsg(INFO, "\tESP32 Chip ID (HEX) = %X", chipid);
	traceMsg(INFO, "\tESP32 Chip Model = %s Rev %d", ESP.getChipModel(), ESP.getChipRevision());
	traceMsg(INFO, "\tESP32 Chi Cores = %d cores", ESP.getChipCores());

    //traceMsg(INFO, "\tFlash Chip Real Size (from chip): %d bits\n\r", ESP.getFlashChipRealSize(), DEC);
    traceMsg(INFO, "\tFlash Chip Size (what compiler set): %d bits", ESP.getFlashChipSize());
    traceMsg(INFO, "\tFlash Chip Speed: %d Hz", ESP.getFlashChipSpeed());
    traceMsg(INFO, "\tFlash Chip Mode: %d", ESP.getFlashChipMode());

    traceMsg(INFO, "\tFree Heap Memory: %d bytes", ESP.getFreeHeap());
    //traceMsg(INFO, "\tHeap Fragmentation: %d%%\n\r", ESP.getHeapFragmentation(), DEC);  // 0% is clean, more than ~50% is not harmless
#else
    traceMsg(INFO, "\tESP32 IP Address = %s",  WiFi.localIP());
    traceMsg(INFO, "\tESP32 MAC Address = %s", buf);
    traceMsg(INFO, "\tESP8266 DHCP Hostname = %s", WiFi.hostname());
    traceMsg(INFO, "\tESP8266 Chip ID (HEX) = %X", ESP.getChipId());

    traceMsg(INFO, "\tFlash Chip ID (HEX): %X", ESP.getFlashChipId());
    traceMsg(INFO, "\tFlash Chip Real Size (from chip): %d bits", ESP.getFlashChipRealSize());
    traceMsg(INFO, "\tFlash Chip Size (what compiler set): %d bits", ESP.getFlashChipSize());
    traceMsg(INFO, "\tFlash Chip Speed: %d Hz", ESP.getFlashChipSpeed());
    traceMsg(INFO, "\tFlash Chip Mode: %d", ESP.getFlashChipMode());

    traceMsg(INFO, "\tFree Heap Memory: %d bytes", ESP.getFreeHeap());
    traceMsg(INFO, "\tHeap Fragmentation: %d%%", ESP.getHeapFragmentation());  // 0% is clean, more than ~50% is not harmless
#endif

}


void DeBug::LoopHandler(void) {

    commandParser(TelnetStream.read());
    commandParser(Serial.read());

/*    switch (TelnetStream.read()) {*/
        /*case 'R':   // reboot the esp8266 / esp32*/
            /*traceMsg(INFO, "Rebooting ...");*/
            /*if (serial) Serial.flush();*/
            /*if (serial) Serial.end();*/
            /*if (telnet) TelnetStream.flush();*/
            /*if (telnet) TelnetStream.stop();*/
            /*delay(100);*/
            /*ESP.restart();*/
            /*break;*/
        /*case 'C':   // drop telnet connection to esp8266 / esp32*/
            /*traceMsg(INFO, "Dropping telnet connection ... bye bye");*/
            /*Serial.flush();*/
            /*TelnetStream.flush();*/
            /*TelnetStream.stop();*/
            /*break;*/
        /*case 's':   // toggle on/off serial trace messages*/
            /*traceMsg(INFO, "Toggle on/off serial trace messages");*/
            /*serialOnOff();*/
            /*break;*/
        /*case 't':   // toggle on/off telnet trace messages*/
            /*traceMsg(INFO, "Toggle on/off telnet trace messages");*/
            /*telnetOnOff();*/
            /*break;*/
        /*case 'p':   // toggle on/off prefix for trace messages*/
            /*traceMsg(INFO, "Toggle on/off prefix for trace messages");*/
            /*prefixOnOff();*/
            /*break;*/
        /*default:*/
            /*break;*/
    /*}*/

/*    switch (Serial.read()) {*/
        /*case 'R':   // reboot the esp8266 / esp32*/
            /*traceMsg(INFO, "Rebooting ...");*/
            /*if (serial) Serial.flush();*/
            /*if (serial) Serial.end();*/
            /*if (telnet) TelnetStream.flush();*/
            /*if (telnet) TelnetStream.stop();*/
            /*delay(100);*/
            /*ESP.restart();*/
            /*break;*/
        /*case 'C':   // drop telnet connection to esp8266 / esp32*/
            /*traceMsg(INFO, "Dropping telnet connection ... bye bye");*/
            /*Serial.flush();*/
            /*TelnetStream.flush();*/
            /*TelnetStream.stop();*/
            /*break;*/
        /*case 's':   // toggle on/off serial trace messages*/
            /*traceMsg(INFO, "Toggle on/off serial trace messages");*/
            /*serial = !serial;*/
            /*printStatus();*/
            /*break;*/
        /*case 't':   // toggle on/off telnet trace messages*/
            /*traceMsg(INFO, "Toggle on/off telnet trace messages");*/
            /*telnet = !telnet;*/
            /*printStatus();*/
            /*break;*/
        /*case 'p':   // toggle on/off prefix for trace messages*/
            /*traceMsg(INFO, "Toggle on/off prefix for trace messages");*/
            /*prefix = !prefix;*/
            /*printStatus();*/
            /*break;*/
        /*default:*/
            /*break;*/
    /*}*/

