jeffskinnerbox/esp32-walkie-talkie/test/hello-world-6/DeBug.cpp
}


// perfrom a single scan for nearby wifi networks
void DeBug::wifiScan(void) {

    unsigned char numSsid;
    char buffer[BUFFER2];
    String st;

    traceMsg(HEADING, "---------------------------- Starting Network Scan -----------------------------");

    numSsid = WiFi.scanNetworks();
    if (numSsid == 0) {
        traceMsg(INFO, "No WiFi networks found.");
        return;
    }

    // print the list of networks seen
    traceMsg(INFO, "Total number of SSIDs found: %u", numSsid);
    snprintf(buffer, BUFFER2, "\t%-20s\t%s\t%s", "SSID", "RSSI", "Encryp_Type");
    traceMsg(INFO, buffer);

    // print the name and characteristics of each network found
    for (int thisNet = 0; thisNet < numSsid; thisNet++) {
        st = WiFi.SSID(thisNet);     // convert from sting object to character string
        switch(WiFi.encryptionType(thisNet)) {
            case 2:
                snprintf(buffer, BUFFER2, "\t%-20s\t%d\t%s", st.c_str(), WiFi.RSSI(thisNet), "TKIP (WPA)");
                break;
            case 4:
                snprintf(buffer, BUFFER2, "\t%-20s\t%d\t%s", st.c_str(), WiFi.RSSI(thisNet), "CCMP (WPA)");
                break;
            case 5:
                snprintf(buffer, BUFFER2, "\t%-20s\t%d\t%s", st.c_str(), WiFi.RSSI(thisNet), "WEP");
                break;
            case 7:
                snprintf(buffer, BUFFER2, "\t%-20s\t%d\t%s", st.c_str(), WiFi.RSSI(thisNet), "NONE");
                break;
            case 8:
                snprintf(buffer, BUFFER2, "\t%-20s\t%d\t%s", st.c_str(), WiFi.RSSI(thisNet), "AUTO");
                break;
            default:
                traceMsg(ERROR, "Returned improper encryption type during WiFi scan.");
                break;
        }

        traceMsg(INFO, buffer);
    }

    traceMsg(HEADING, "---------------------------- Network Scan Completed ----------------------------");

}



// ------------------ Explicitly Declare All Needed Functions ------------------

template<typename T>
void DeBug::printMsg(T var) {

    if (serial) Serial.print(var);

    if (!telnet) return;
    else TelnetStream.print(var);
}


template<typename T, typename U>
void DeBug::printMsg(T str, U var) {

    if (serial) {
        Serial.print(str);
        Serial.print(var);
    }

    if (!telnet) return;
    else {
        TelnetStream.print(str);
        TelnetStream.print(var);
    }
}


template<typename T, typename U, typename Z>
void DeBug::printMsg(T *str, U var, Z format) {

    if (serial) {
        Serial.print(str);
        Serial.print(var, format);
    }

    if (!telnet) return;
    else {
        TelnetStream.print(str);
        TelnetStream.print(var, format);
    }
}


/*void DeBug::traceMsg(int lev, char *str) {*/

    /*if (prefix) location();*/

    /*if (lev != UNLABELED) {*/
        /*if (serial) {*/
            /*Serial.print(label[lev]);*/
            /*Serial.println(str);*/
        /*}*/
        /*if (telnet) {*/
            /*TelnetStream.print(label[lev]);*/
            /*TelnetStream.println(str);*/
        /*}*/
    /*} else*/
        /*printMsg(str);*/

/*}*/


/*template<typename T>*/
/*void DeBug::traceMsg(int lev, char *str, T var) {*/

    /*if (prefix) location();*/

    /*if (lev != UNLABELED) {*/
        /*if (serial) {*/
            /*Serial.print(label[lev]);*/
            /*Serial.print(str);*/
            /*Serial.println(var);*/
        /*}*/
        /*if (telnet) {*/
            /*TelnetStream.print(label[lev]);*/
            /*TelnetStream.print(str);*/
            /*TelnetStream.println(var);*/
        /*}*/
    /*} else {*/
        /*printMsg(str);*/
        /*printMsg(var);*/
    /*}*/

/*}*/


/*template<typename T, typename U>*/
/*void DeBug::traceMsg(int lev, char *str, T var, U format) {*/

    /*if (prefix) location();*/

    /*if (lev != UNLABELED) {*/
        /*if (serial) {*/
            /*Serial.print(label[lev]);*/
            /*Serial.printf(str, var, format);*/
        /*}*/
        /*if (telnet) {*/
            /*TelnetStream.print(label[lev]);*/
            /*TelnetStream.printf(str, var, format);*/
        /*}*/
    /*} else {*/
        /*printMsg(str);*/
        /*printMsg(var, format);*/
    /*}*/

/*}*/


bool DeBug::traceMsg(int lev, char *str) {

    if (prefix) location();

    if (lev != UNLABELED) {
        if (serial) {
            Serial.print(label[lev]);
            Serial.println(str);
        }
        if (telnet) {
            TelnetStream.print(label[lev]);
            TelnetStream.println(str);
        }
    } else
        printMsg(str);

    return true;

}


/*------------------------------------------------------------------------------

Description:
    DEBUGTRACE is making use of snprintf.
    snprintf stands for “String print”. Instead of printing on console,
    it store output on character buffer which are specified in snprintf.

    The size of the buffer should be large enough to contain the entire
    resulting string (see snprintf for a safer version).

    A terminating null character is automatically appended after the content written.

Syntax:
    int snprintf(char *buffer, int buffer_size, const char *format-specifier, ...);

    A format specifier follows this prototype:
    %[flags][width][.precision][length]specifier

Return:
    If successful, it returns the total number of characters written excluding
    null-character (aka '\0') appended in the string, in case of failure a
    negative number is returned.

Sources:
    Cplusplus.com - https://cplusplus.com/reference/cstdio/snprintf/
    Variadic function templates in C++ - https://www.geeksforgeeks.org/variadic-function-templates-c/
    Variadic templates in C++ - https://eli.thegreenplace.net/2014/variadic-templates-in-c/

------------------------------------------------------------------------------*/


// for printing of IPAdress type variables
bool DeBug::traceMsg(int lev, const char *format, IPAddress ip) {

    char buf2[BUFFER1];
    int rtn;

    // create printable string in buffer
    rtn = snprintf(buf2, BUFFER1, "%d.%d.%d.%d", ip[0], ip[1], ip[2], ip[3]);

