jeffskinnerbox/esp32-walkie-talkie/test/hello-world-6/DeBug.cpp
    // check if you have an error - only when this returned value is non-negative
    // and less than n, the string has been completely written
    if (rtn <= 0 && rtn >= BUFFER1) {
        traceMsg(ERROR, "Buffer overflow condition in DeBug::traceMsg() - #1");
        return false;
    }

    rtn = traceMsg(lev, format, buf2);

    return rtn;

}


/*// return MAC address as a pointer to character string  */
/*bool DeBug::macAddress(String mac, char *buf_str, int buf_size) {*/

    /*// create printable string in buffer*/
    /*rtn = snprintf(buf_str, buf_size, "%02X:%02X:%02X:%02X:%02X:%02X", mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);*/

    /*// check if you have an error - only when this returned value is non-negative*/
    /*// and less than n, the string has been completely written*/
    /*if (rtn <= 0 && rtn >= buf_size) {*/
        /*traceMsg(ERROR, "Buffer overflow condition in DeBug::traceMsg() - #4");*/
        /*return false;*/
    /*}*/

    /*return true;*/

/*}*/



// Variadic function Template that takes variable number of arguments and prints all of them.
template<typename... Types>
bool DeBug::traceMsg(int lev, const char *format, Types... var) {

    char buf[BUFFER3];
    int rtn;

    // create printable string in buffer
    rtn = snprintf(buf, BUFFER3, format, var...);

    // check if you have an error - only when this returned value is non-negative
    // and less than n, the string has been completely written
    if (rtn <= 0 && rtn >= BUFFER3) {
        traceMsg(ERROR, "Buffer overflow condition in DeBug::traceMsg() - #3");
        return false;
    }

    if (prefix) location();

    if (lev != UNLABELED) {
        if (serial) {
            Serial.print(label[lev]);
            Serial.println(buf);
        }
        if (telnet) {
            TelnetStream.print(label[lev]);
            TelnetStream.println(buf);
        }
    } else
        printMsg(buf);

    return true;

}



// ----------------- Templatize Additionally Needed Functions ------------------

template void DeBug::printMsg<int>(int);
template void DeBug::printMsg<char*>(char*);
template void DeBug::printMsg<wl_status_t>(wl_status_t);
template void DeBug::printMsg<char const*>(char const*);
template void DeBug::printMsg<unsigned int, int>(unsigned int, int);

/*template void DeBug::traceMsg<int>(int, char*, int);*/
/*template void DeBug::traceMsg<bool>(int, char*, bool);*/
/*template void DeBug::traceMsg<char*>(int, char*, char*);*/
/*template void DeBug::traceMsg<short>(int, char*, short);*/
/*template void DeBug::traceMsg<String>(int, char*, String);*/
/*template void DeBug::traceMsg<int, int>(int, char*, int, int);*/
/*template void DeBug::traceMsg<IPAddress>(int, char*, IPAddress);*/
/*template void DeBug::traceMsg<char const*>(int, char*, char const*);*/
/*template void DeBug::traceMsg<wl_status_t>(int, char*, wl_status_t);*/
/*template void DeBug::traceMsg<unsigned int>(int, char*, unsigned int);*/
/*template void DeBug::traceMsg<unsigned char>(int, char*, unsigned char);*/
/*template void DeBug::traceMsg<unsigned long>(int, char*, unsigned long);*/
/*template void DeBug::traceMsg<FlashMode_t, int>(int, char*, FlashMode_t, int);*/
/*template void DeBug::traceMsg<int, char const*>(int, char*, int, char const*);*/
/*template void DeBug::traceMsg<unsigned int, int>(int, char*, unsigned int, int);*/
/*template void DeBug::traceMsg<unsigned char, int>(int, char*, unsigned char, int);*/
/*template void DeBug::traceMsg<char*, char const*>(int, char*, char*, char const*);*/
/*template void DeBug::traceMsg<char const*, char*>(int, char*, char const*, char*);*/

/*template void DeBug::traceMsg<gpio_num_t>(int, char*, gpio_num_t);*/
/*template void DeBug::traceMsg<i2s_port_t>(int, char*, i2s_port_t);*/

/*#ifdef ESP32*/
/*template void DeBug::traceMsg<StringSumHelper>(int, char*, StringSumHelper);*/
/*#else*/
/*#endif*/

//template void DeBug::traceMsg(int, char*, T) [with T = char* (*)(const char*, int)];
//template void DeBug::traceMsg<char* (*)(char const*, int)>(int, char*, char* (*)(char const*, int));
//
//template bool DeBug::traceMsg<unsigned char, unsigned char, unsigned char, unsigned char>(int, char const*, unsigned char, unsigned char, unsigned char, unsigned char);

/*#ifdef XXX*/
/*template bool DeBug::traceMsg<>(int, char const*);*/
/*template bool DeBug::traceMsg<char const*, long, int>(int, char const*, char const*, long, int);*/
/*template bool DeBug::traceMsg<char*>(int, char const*, char*);*/
/*template bool DeBug::traceMsg<char const*>(int, char const*, char const*);*/
/*template bool DeBug::traceMsg<int>(int, char const*, int);*/

/*template bool DeBug::traceMsg<wl_status_t>(int, char const*, wl_status_t);*/
/*template bool DeBug::traceMsg<unsigned long>(int, char const*, unsigned long);*/

/*template bool DeBug::traceMsg<float>(int, char const*, float);*/
/*template bool DeBug::traceMsg<long>(int, char const*, long);*/

/*template bool DeBug::traceMsg<char>(int, char const*, char);*/
/*#endif*/

template bool DeBug::traceMsg<char>(int, char const*, char);
template bool DeBug::traceMsg<int>(int, char const*, int);
template bool DeBug::traceMsg<long>(int, char const*, long);
template bool DeBug::traceMsg<float>(int, char const*, float);
template bool DeBug::traceMsg<unsigned long>(int, char const*, unsigned long);
template bool DeBug::traceMsg<wl_status_t>(int, char const*, wl_status_t);
template bool DeBug::traceMsg<float*>(int, char const*, float*);

// --------------------------- Construct DeBug Object --------------------------

// for trace messages/debugging, construct object DB as class DeBug
//DeBug DB = DeBug();
DeBug DB = DeBug(true, true, false);

